In [2]:
import pandas as pd
import numpy as np

In [3]:
given_list = [2, 4, 6, 8, 10]
sr = pd.Series(given_list)
sr

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [5]:
sr / 2

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [4]:
sr1 = sr.apply(lambda x:x/2)
sr1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [8]:
#Date Series Generation
date_series = pd.date_range(start='05-01-2021', end='05-30-2021')

In [9]:
date_series

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12',
               '2021-05-13', '2021-05-14', '2021-05-15', '2021-05-16',
               '2021-05-17', '2021-05-18', '2021-05-19', '2021-05-20',
               '2021-05-21', '2021-05-22', '2021-05-23', '2021-05-24',
               '2021-05-25', '2021-05-26', '2021-05-27', '2021-05-28',
               '2021-05-29', '2021-05-30'],
              dtype='datetime64[ns]', freq='D')

In [10]:
dictionary = {'name': ['Vinay', 'Kushal', 'Aman'],
              'age' : [22, 25, 24],
              'occ' : ['engineer', 'doctor', 'accountant']}
df = pd.DataFrame(dictionary)
df

     name  age         occ
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant

In [14]:
dict1 = {"name": 'john', "age": 25, "occ": "engineer"}
df1 = pd.DataFrame(dict1, index=['0'])
df1

   name  age       occ
0  john   25  engineer

In [25]:
lists = [[2, 'Vishal', 22],
         [1, 'Kushal', 25],
         [1, 'Aman', 24]]
df2 = pd.DataFrame(lists, columns=['id', 'name', 'age'])
df2

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

In [19]:
arr = np.arange(0, 9).reshape(3, 3)
arr

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [20]:
arr.ndim

2

In [26]:
df3 = pd.DataFrame(arr, columns=['a', 'b', 'c'])

In [27]:
df3

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [29]:
list1 = [[2, 'Vishal', 22, 'engineer'],
         [1, 'Kushal', 25, 'doctor'],
         [1, 'Aman', 24, 'artist']]
df4 = pd.DataFrame(list1, columns=['id', 'name', 'age', 'occ'])
df4

   id    name  age       occ
0   2  Vishal   22  engineer
1   1  Kushal   25    doctor
2   1    Aman   24    artist

In [30]:
#Setting Custom Index in Dataframe
df4.set_index('id')

      name  age       occ
id
2   Vishal   22  engineer
1   Kushal   25    doctor
1     Aman   24    artist

In [31]:
# Sorting a Dataframe by Index
df4.sort_index()

   id    name  age       occ
0   2  Vishal   22  engineer
1   1  Kushal   25    doctor
2   1    Aman   24    artist

In [32]:
# Sorting a Dataframe by Multiple Columns
df4.sort_values(by=['id', 'age'])

   id    name  age       occ
2   1    Aman   24    artist
1   1  Kushal   25    doctor
0   2  Vishal   22  engineer

In [36]:
# DataFrame with Custom Index to DataFrame with Dataframe with default indexes
df4_custom = df4.set_index('id')
df4_custom

      name  age       occ
id
2   Vishal   22  engineer
1   Kushal   25    doctor
1     Aman   24    artist

In [37]:
df4_custom.reset_index()

   id    name  age       occ
0   2  Vishal   22  engineer
1   1  Kushal   25    doctor
2   1    Aman   24    artist

In [38]:
#indexing and Selecting Columns in a DataFrame
df4['name']

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

In [39]:
df4.loc[:, 'name']

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

In [40]:
df4.iloc[:, 1]

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

In [42]:
#Indexing and Selecting Rows in a DataFrame
df4.loc[1, :]

id           1
name    Kushal
age         25
occ     doctor
Name: 1, dtype: object

In [43]:
df4.loc[[1,2], :]

   id    name  age     occ
1   1  Kushal   25  doctor
2   1    Aman   24  artist

In [44]:
df4.iloc[1, :]

id           1
name    Kushal
age         25
occ     doctor
Name: 1, dtype: object

In [45]:
df4.iloc[1:, :]

   id    name  age     occ
1   1  Kushal   25  doctor
2   1    Aman   24  artist

In [47]:
#Conditional Selection of Rows in a DataFrame
df4.loc[(df4.age) > 22]

   id    name  age     occ
1   1  Kushal   25  doctor
2   1    Aman   24  artist

In [52]:
df5 = pd.read_csv("Documents/Book1.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'Documents/Book1.csv'